In this notebook, you'll see how to connect to a Postgres database using the sqlalchemy library.

For this notebook, you'll need both the `sqlalchemy` and `psycopg2` libraries installed.

In [4]:
from sqlalchemy import create_engine

First, we need to create a connection string. The format is

 ```<dialect(+driver)>://<username>:<password>@<hostname>:<port>/<database>```

To connect to the Lahman baseball database, you can use the following connection string.

In [5]:
database_name = 'scooters'    # Fill this in with your scooter database name

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

Now, we need to create an engine and use it to connect.

In [6]:
engine = create_engine(connection_string)

Now, we can create our query and pass it into the `.query()` method.

In [4]:
# Look at difference in run time for this:
query = '''
SELECT latitude
FROM scooters;
'''

result = engine.execute(query)

In [5]:
# Vs this:
query = '''
SELECT COUNT(latitude)
FROM scooters;
'''

result = engine.execute(query)

You can then fetch the results as tuples using either `fetchone` or `fetchall`:

In [6]:
result.fetchone()

(73414043,)

In [7]:
result.fetchall()

[]

On the other hand, sqlalchemy plays nicely with pandas.

In [7]:
import pandas as pd

In [9]:
lat = pd.read_sql(query, con = engine)
lat.head()

      count
0  73414043

For much more information about SQLAlchemy and to see a more “Pythonic” way to execute queries, see Introduction to Databases in Python: https://www.datacamp.com/courses/introduction-to-relational-databases-in-python

In [39]:
query ='''
SELECT *
FROM scooters
Limit 5;
'''
result = engine.execute(query)

In [40]:
print(result)

<sqlalchemy.engine.cursor.LegacyCursorResult object at 0x000001F8958217B0>

In [91]:
query = '''
SELECT *
FROM scooters
LIMIT 10
'''

scooters_df=pd.read_sql_query(query, engine)

In [92]:
print(df)

              pubdatetime   latitude  longitude        sumdid sumdtype
0 2019-05-01 00:01:41.247  36.136822 -86.799877  PoweredLIRL1  Powered  \
1 2019-05-01 00:01:41.247  36.191252 -86.772945  PoweredXWRWC  Powered
2 2019-05-01 00:01:41.247  36.144752 -86.806293  PoweredMEJEH  Powered
3 2019-05-01 00:01:41.247  36.162056 -86.774688  Powered1A7TC  Powered
4 2019-05-01 00:01:41.247  36.150973 -86.783109  Powered2TYEF  Powered
5 2019-05-01 00:01:41.247  36.157188 -86.769978  Powered3F3VK  Powered
6 2019-05-01 00:01:41.247  36.154348 -86.784765  PoweredVL7YG  Powered
7 2019-05-01 00:01:41.247  36.158930 -86.775987  Powered5LNUG  Powered
8 2019-05-01 00:01:41.247  36.135993 -86.804226  Powered7SPQQ  Powered
9 2019-05-01 00:01:41.247  36.148938 -86.811256  PoweredBV1DT  Powered

   chargelevel sumdgroup  costpermin companyname
0         93.0   scooter         0.0        Bird
1         35.0   scooter         0.0        Bird
2         90.0   scooter         0.0        Bird
3         88.0   scooter         0.0        Bird
4         98.0   scooter         0.0        Bird
5         82.0   scooter         0.0        Bird
6         56.0   scooter         0.0        Bird
7        100.0   scooter         0.0        Bird
8         85.0   scooter         0.0        Bird
9         65.0   scooter         0.0        Bird

In [94]:

scooters_df.head(5)

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-01 00:01:41.247,36.136822,-86.799877,PoweredLIRL1,Powered,93.0,scooter,0.0,Bird
1,2019-05-01 00:01:41.247,36.191252,-86.772945,PoweredXWRWC,Powered,35.0,scooter,0.0,Bird
2,2019-05-01 00:01:41.247,36.144752,-86.806293,PoweredMEJEH,Powered,90.0,scooter,0.0,Bird
3,2019-05-01 00:01:41.247,36.162056,-86.774688,Powered1A7TC,Powered,88.0,scooter,0.0,Bird
4,2019-05-01 00:01:41.247,36.150973,-86.783109,Powered2TYEF,Powered,98.0,scooter,0.0,Bird

- Are there any null values in any columns in either table?
- What date range is represented in each of the date columns? Investigate any values that seem odd.
- Is time represented with am/pm or using 24 hour values in each of the columns that include time?
- What values are there in the sumdgroup column? Are there any that are not of interest for this project?
- What are the minimum and maximum values for all the latitude and longitude columns? Do these ranges make sense, or is there anything surprising?
-What is the range of values for trip duration and trip distance? Do these values make sense? Explore values that might seem questionable.
- Check out how the values for the company name column in the scooters table compare to those of the trips table. What do you notice?

In [ ]:
- Are there any null values in any columns in either table?

In [54]:
null_counts = df.isnull().sum()
null_counts[null_counts > 0].sort_values(ascending=False)

Series([], dtype: int64)

- What date range is represented in each of the date columns? Investigate any values that seem odd.

In [56]:
print(df.pubdatetime)

0   2019-05-01 00:01:41.247
1   2019-05-01 00:01:41.247
2   2019-05-01 00:01:41.247
3   2019-05-01 00:01:41.247
4   2019-05-01 00:01:41.247
5   2019-05-01 00:01:41.247
6   2019-05-01 00:01:41.247
7   2019-05-01 00:01:41.247
8   2019-05-01 00:01:41.247
9   2019-05-01 00:01:41.247
Name: pubdatetime, dtype: datetime64[ns]

In [64]:
query = '''
SELECT 'scooters.subdatetime'
FROM scooters
'''

sub=pd.read_sql_query(query, engine)

In [67]:
print(sub)

                      ?column?
0         scooters.subdatetime
1         scooters.subdatetime
2         scooters.subdatetime
3         scooters.subdatetime
4         scooters.subdatetime
...                        ...
73414038  scooters.subdatetime
73414039  scooters.subdatetime
73414040  scooters.subdatetime
73414041  scooters.subdatetime
73414042  scooters.subdatetime

[73414043 rows x 1 columns]

In [79]:
query = '''
SELECT MAX(pubdatetime)
FROM scooters
LIMIT 5
'''

pbt_df=pd.read_sql_query(query, engine)

In [80]:
print(pbt_df)

                  max
0 2019-07-31 23:59:57

In [81]:
query = '''
SELECT *
FROM trips
LIMIT 5
'''

trips_df=pd.read_sql_query(query, engine)

In [82]:
print(trips_df)

             pubtimestamp companyname triprecordnum         sumdid
0 2019-05-01 00:00:55.423        Bird       BRD2134   Powered9EAJL  \
1 2019-05-01 00:03:33.147        Lyft          LFT5  Powered296631
2 2019-05-01 00:05:55.570        Bird       BRD2168   Powered7S2UU
3 2019-05-01 00:05:55.570        Bird       BRD2166   PoweredZIIVX
4 2019-05-01 00:05:55.570        Bird       BRD2165   PoweredJ7MB3

   tripduration  tripdistance   startdate        starttime     enddate
0        3.0000     958.00528  2019-05-01  00:00:20.460000  2019-05-01  \
1        1.7156    1371.39112  2019-05-01  00:01:50.090000  2019-05-01
2        3.0000    2296.58800  2019-05-01  00:03:47.363333  2019-05-01
3        3.0000    1200.78744  2019-05-01  00:04:21.386666  2019-05-01
4        2.0000     351.04988  2019-05-01  00:04:27.796666  2019-05-01

           endtime  startlatitude  startlongitude  endlatitude  endlongitude
0  00:02:52.346666       36.15710       -86.80360     36.15660     -86.80670  \
1  00:03:33.026666       36.15797       -86.77896     36.16054     -86.77689
2  00:07:13.596666       36.15470       -86.78180     36.15650     -86.78680
3  00:06:59.176666       36.14940       -86.77950     36.15310     -86.77960
4  00:06:23.150000       36.17780       -86.78660     36.17740     -86.78760

                                           triproute               create_dt
0  [(36.157235, -86.803612), (36.157235, -86.8036... 2019-05-02 05:30:23.780
1  [(36.15797, -86.77896), (36.15795, -86.77873),... 2019-05-02 07:20:32.757
2  [(36.155068, -86.782124), (36.156597, -86.78675)] 2019-05-02 05:30:24.530
3  [(36.149741, -86.779344), (36.149741, -86.7793... 2019-05-02 05:30:24.237
4  [(36.177699, -86.786477), (36.177711, -86.7864... 2019-05-02 05:30:24.207

In [83]:
query = '''
SELECT MAX(startdate)
FROM trips
'''

startdate_df=pd.read_sql_query(query, engine)

What date range is represented in each of the date columns? Investigate any values that seem odd.

In [84]:
print(startdate_df)

          max
0  2019-07-31

In [99]:
query = '''
SELECT MIN(startdate), MAX(startdate)
FROM trips
'''

startdate_df=pd.read_sql_query(query, engine)

In [100]:
print(startdate_df)

          min         max
0  2019-05-01  2019-07-31

In [97]:
query = '''
SELECT MIN(enddate), MAX(enddate)
FROM trips
'''

enddate_df=pd.read_sql_query(query, engine)

In [98]:
print(enddate_df)

          min         max
0  2019-05-01  2019-08-01

In [87]:
print(trips_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 16 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   pubtimestamp    5 non-null      datetime64[ns]
 1   companyname     5 non-null      object
 2   triprecordnum   5 non-null      object
 3   sumdid          5 non-null      object
 4   tripduration    5 non-null      float64
 5   tripdistance    5 non-null      float64
 6   startdate       5 non-null      object
 7   starttime       5 non-null      object
 8   enddate         5 non-null      object
 9   endtime         5 non-null      object
 10  startlatitude   5 non-null      float64
 11  startlongitude  5 non-null      float64
 12  endlatitude     5 non-null      float64
 13  endlongitude    5 non-null      float64
 14  triproute       5 non-null      object
 15  create_dt       5 non-null      datetime64[ns]
dtypes: datetime64[ns](2), float64(6), object(8)
memory usage: 768.0+ bytes
None

- Are there any null values in any columns in either table?

In [89]:
null_counts = trips_df.isnull().sum()
null_counts[null_counts > 0].sort_values(ascending=False)

Series([], dtype: int64)

In [90]:
print(null_counts)

pubtimestamp      0
companyname       0
triprecordnum     0
sumdid            0
tripduration      0
tripdistance      0
startdate         0
starttime         0
enddate           0
endtime           0
startlatitude     0
startlongitude    0
endlatitude       0
endlongitude      0
triproute         0
create_dt         0
dtype: int64

In [95]:
scooters_null_counts = scooters_df.isnull().sum()
null_counts[null_counts > 0].sort_values(ascending=False)

Series([], dtype: int64)

In [96]:
print(scooters_null_counts)

pubdatetime    0
latitude       0
longitude      0
sumdid         0
sumdtype       0
chargelevel    0
sumdgroup      0
costpermin     0
companyname    0
dtype: int64

In [102]:
query = '''
SELECT DISTINCT(companyname)
FROM scooters
'''

company_name_df=pd.read_sql_query(query, engine)

company names

In [103]:
print(company_name_df)

  companyname
0        Bird
1        Bolt
2      Gotcha
3        Jump
4        Lime
5        Lyft
6        Spin

What values are there in the sumdgroup column? Are there any that are not of interest for this project?

In [108]:
query = '''
SELECT DISTINCT(sumdgroup)
FROM scooters
LIMIT 5
'''

sumdgroup_df=pd.read_sql_query(query, engine)

In [110]:
print(sumdgroup_df)

  sumdgroup
0   bicycle
1   scooter
2   Scooter

In [107]:
sumdgroup_df.head(5)

  sumdgroup
0   scooter
1   scooter
2   scooter
3   scooter
4   scooter

-What is the range of values for trip duration and trip distance? Do these values make sense? Explore values that might seem questionable.(the answers are in minutes for the duration, there is a negative value that can be tied to overnight possibly clock issues or time change)

In [118]:
query = '''
SELECT MAX(tripduration), MIN(tripduration)
FROM trips

'''

range_trip_duration_distance=pd.read_sql_query(query, engine)

In [119]:
print(range_trip_duration_distance)

        max        min
0  512619.0 -19.358267

In [111]:
num_of_scooters_over_time = '''
SELECT EXTRACT(MONTH FROM pubdatetime) as month, companyname, COUNT(sumdid)
FROM scooters
Group BY month, companyname;
'''
result = engine.execute(num_of_scooters_over_time)
count_each_company_time = pd.read_sql(num_of_scooters_over_time, con = engine)
count_each_company_time.head(21)

    month companyname     count
0     5.0        Bird   4334006
1     5.0        Bolt    524395
2     5.0      Gotcha    915314
3     5.0        Jump   2984630
4     5.0        Lime   7120576
5     5.0        Lyft   3112581
6     5.0        Spin   1301001
7     6.0        Bird   4215302
8     6.0        Bolt   1764036
9     6.0      Gotcha   1830453
10    6.0        Jump   8482893
11    6.0        Lime   6161191
12    6.0        Lyft   3084229
13    6.0        Spin   2507991
14    7.0        Bird   3702282
15    7.0        Bolt   1188767
16    7.0      Gotcha   1933513
17    7.0        Jump  10367575
18    7.0        Lime   3242494
19    7.0        Lyft   2890233
20    7.0        Spin   1750581

In [ ]:
scooter_count = '''
SELECT DISTINCT companyname, COUNT(DISTINCT(sumdid)), EXTRACT(MONTH FROM pubdatetime) as month
FROM scooters
GROUP BY month
'''
result = engine.execute(query)

In [2]:
import pandas as pd

In [ ]:
query = '''
SELECT companyname, COUNT(DISTINCT sumdid)
FROM scooters
GROUP BY companyname
'''
pd.read_sql(query, con = engine)